Tekla Open API Reference for Tekla Structures 2025
Analysis Methods
The Analysis type exposes the following members.
Methods
Name | Description
GetAnalysisObjectSelector
 Returns the analysis object selector.
GetConnectionStatus
 Checks the connection status of the Tekla Structures process.
Top
See Also
Reference
Analysis Class
Tekla.Structures.Analysis Namespace